package Timus;/*
 * Copyright (C) 2023 Wilastian. - All Rights Reserved
 *
 * Unauthorized copying or redistribution of this file in source and binary forms via any medium
 * is strictly prohibited.
 */
/*
1601. АнтиКАПС
Правила исправлений очень просты:
Предложения в сообщении состоят из слов, пробелов и знаков препинания.
Слова состоят из букв латинского алфавита.
Предложения оканчиваются точкой, восклицательным или вопросительным знаком.
Первое слово в предложении должно начинаться с заглавной буквы, все остальные буквы в предложении должны быть строчными.
Исходные данные
Входные данные содержат сообщение Анжелы, которое состоит из латинских букв в верхнем регистре, пробелов, переводов строк и знаков препинания: точек, запятых, тире, двоеточий, восклицательных и вопросительных знаков. Общая длина сообщения не превосходит 10000 символов.
Результат
Выведите исправленное сообщение Анжелы.
Пример
исходные данные	результат
HI THERE!
HOW DID YOU KNOW I AM A BLONDE?
Hi there!
How did you know i am a blonde?
 */
public class Task1601 {
    public static void main(String[] args) {

    }
}
